#brew analytics off

# =========================================================
# Taps
# =========================================================

tap "mdnmdn/asimeow"
tap "azure/kubelogin"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "mutagen-io/mutagen"
tap "xorpse/formulae"
tap "yt-dlp/taps"

# =========================================================
# Shell & Terminal
# =========================================================

brew "bash"
brew "zsh"
brew "fzf"
brew "zoxide"
brew "tmux"
brew "screen"
brew "yazi"

# =========================================================
# Core CLI Utilities
# =========================================================

brew "coreutils"
brew "binutils"
brew "gnu-sed"
brew "gnu-tar"
brew "moreutils"
brew "tree"
brew "watch"
brew "pv"
brew "pstree"
brew "fd"
brew "ripgrep"
brew "bat"
brew "hexyl"
brew "jq"
brew "yq"
brew "kondo"

# =========================================================
# Networking & Transfer
# =========================================================

brew "aria2"
brew "curl"
brew "wget"
brew "rsync"
brew "mtr"
brew "nmap"
brew "sshpass"

# =========================================================
# Version Control
# =========================================================

brew "git"
brew "git-lfs"
brew "gh"
brew "glab"
brew "tower"

# =========================================================
# Editors & IDE Support
# =========================================================

brew "neovim"
brew "lua-language-server"
brew "rust-analyzer"
brew "typescript-language-server"
brew "clang-format"
brew "stylua"

# =========================================================
# Languages & Runtimes
# =========================================================

brew "python@3.14"
brew "node"
brew "nvm"
brew "go"
brew "php"
brew "llvm"
brew "uv"

# =========================================================
# Build Tools & Automation
# =========================================================

brew "cmake"
brew "autoconf"
brew "just"
brew "scriptisto"
brew "shellcheck"
brew "shfmt"
brew "ansible"
brew "stow"

# =========================================================
# Kubernetes & Cloud
# =========================================================

brew "kubernetes-cli"
brew "kubectx"
brew "kubecolor"
brew "helm@3"
brew "azure/kubelogin/kubelogin"
brew "sops"

# =========================================================
# Media & Image Processing
# =========================================================

brew "ffmpeg"
brew "flac"
brew "imagemagick"
brew "pngcrush"
brew "oxipng"
brew "yt-dlp", args: ["HEAD"]

# =========================================================
# Document & Text Processing
# =========================================================

brew "aspell"
brew "pandoc"
brew "texlive"

# =========================================================
# System Monitoring & Info
# =========================================================

brew "btop"
brew "htop"
brew "hwatch"
brew "fastfetch"
brew "watson"
brew "tokei"

# =========================================================
# Compression & Archives
# =========================================================

brew "p7zip"
brew "pbzip2"

# =========================================================
# Security & Encryption
# =========================================================

brew "age"
brew "gnutls"

# =========================================================
# File Managers & Misc CLI
# =========================================================

brew "midnight-commander"
brew "mas"
brew "worktrunk"

# =========================================================
# Libraries & Low-Level
# =========================================================

brew "glib"
brew "e2fsprogs"

# =========================================================
# Third-Party Tapped Formulae
# =========================================================

brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mdnmdn/asimeow/asimeow"
brew "mutagen-io/mutagen/mutagen"

# =========================================================
# Backup
# =========================================================

brew "restic"

# =========================================================
# Casks — Browsers
# =========================================================

cask "arc"
cask "google-chrome"
cask "zen-browser"

# =========================================================
# Casks — Communication
# =========================================================

cask "discord"
cask "slack"
cask "signal"
cask "zoom"

# =========================================================
# Casks — Productivity & Notes
# =========================================================

cask "alfred"
cask "obsidian"
cask "rocket"

# =========================================================
# Casks — Development
# =========================================================

cask "claude"
cask "ghostty"
cask "orbstack"
cask "tower"
cask "wireshark"

# =========================================================
# Casks — Media & Design
# =========================================================

cask "affinity-designer"
cask "affinity-photo"
cask "handbrake"
cask "handbrake-app"
cask "imageoptim"
cask "obs"
cask "subler"
cask "upscayl"
cask "vlc"

# =========================================================
# Casks — System Utilities
# =========================================================

cask "1password"
cask "appcleaner"
cask "bartender"
cask "elgato-control-center"
cask "hammerspoon"
cask "istat-menus@6"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "utm"
cask "zerotier-one"

# =========================================================
# Casks — File Transfer & Storage
# =========================================================

cask "libreoffice"
cask "transmit"

# =========================================================
# Casks — 3D Printing & Hardware
# =========================================================

cask "bambu-studio"
cask "raspberry-pi-imager"

# =========================================================
# Casks — Fonts
# =========================================================

cask "font-dejavu"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# =========================================================
# Mac App Store
# =========================================================

mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122
mas 'CopyQueue', id: 711074010
mas 'Creator\'s Best Friend', id: 1524172135
mas 'Disk Speed Test', id: 425264550
mas 'Droplr', id: 498672703
mas 'Fantastical', id: 975937182
mas 'GarageBand', id: 682658836
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'The Unarchiver', id: 425424353
mas 'Webcam Settings', id: 533696630
mas 'Windows App', id: 1295203466
mas 'Xcode', id: 497799835
mas 'Yoink', id: 457622435
