tap "austinliuigi/brew-neovim-nightly", "https://github.com/austinliuigi/brew-neovim-nightly.git"
tap "azure/kubelogin"
tap "chase/tap"
tap "felixkratz/formulae"
tap "freecad/freecad"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "messense/macos-cross-toolchains"
tap "mutagen-io/mutagen"
tap "xorpse/formulae"
tap "yt-dlp/taps"
brew "adr-tools"
brew "advancecomp"
brew "age"
brew "ansible"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "aria2"
brew "aspell"
brew "autoconf"
brew "axel"
brew "azure-cli"
brew "b2-tools"
brew "bash"
brew "bat"
brew "glib"
brew "harfbuzz"
brew "bazel"
brew "bfg"
brew "binaryen"
brew "binutils"
brew "brainfuck"
brew "btop"
brew "protobuf"
brew "protobuf-c"
brew "yara"
brew "clamav"
brew "cmake"
brew "coreutils"
brew "dfu-util"
brew "flac"
brew "fluid-synth"
brew "dosbox-x"
brew "dust"
brew "e2fsprogs"
brew "eigen"
brew "pillow"
brew "esphome"
brew "esptool"
brew "eza"
brew "fastfetch"
brew "fd"
brew "unbound"
brew "gnutls"
brew "libass"
brew "libbluray"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gallery-dl", args: ["HEAD"]
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "glab"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "gobject-introspection"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "groff"
brew "handbrake"
brew "helm"
brew "hexyl"
brew "htop"
brew "hwatch"
brew "shared-mime-info"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "innoextract"
brew "jq"
brew "just"
brew "kondo"
brew "kubecolor"
brew "kubernetes-cli"
brew "kubectx"
brew "libgsf"
brew "libopenmpt"
brew "llvm"
brew "luarocks"
brew "node"
brew "markdownlint-cli"
brew "mas"
brew "midnight-commander"
brew "minikube"
brew "monolith"
brew "moreutils"
brew "mplayer"
brew "mtools"
brew "mtr"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "numpy", link: false
brew "pngquant"
brew "ocrmypdf"
brew "open-mpi"
brew "p7zip"
brew "pbzip2"
brew "pdf2image"
brew "php"
brew "pigz"
brew "platformio"
brew "pngcrush"
brew "pstree"
brew "pv"
brew "py3cairo"
brew "pygobject3"
brew "python-markdown", link: false
brew "python-setuptools"
brew "python-tabulate"
brew "python@3.10"
brew "python@3.11"
brew "python@3.8"
brew "python@3.9"
brew "restic"
brew "ripgrep"
brew "rom-tools"
brew "rsync"
brew "screen"
brew "scriptisto"
brew "scummvm"
brew "sdl2_gfx"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "showkey"
brew "sops"
brew "sox"
brew "sshpass"
brew "stm32flash"
brew "stow"
brew "swftools"
brew "tesseract-lang"
brew "texlive"
brew "tmux"
brew "tree"
brew "uade"
brew "upx"
brew "vim"
brew "viu"
brew "watch"
brew "wget"
brew "xdelta"
brew "youtube-dl"
brew "yq"
brew "yt-dlp", args: ["HEAD"]
brew "zellij"
brew "zsh"
brew "azure/kubelogin/kubelogin"
brew "chase/tap/awrit"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
brew "mutagen-io/mutagen/mutagen"
cask "1password"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "android-platform-tools"
cask "appcleaner"
cask "arduino"
cask "audacity"
cask "barrier"
cask "bartender"
cask "betterdisplay"
cask "blackhole-2ch"
cask "blender"
cask "cool-retro-term"
cask "cursorcerer"
cask "discord"
cask "firefox"
cask "folx"
cask "font-dejavu"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "fs-uae"
cask "fs-uae-launcher"
cask "google-chrome"
cask "grafx"
cask "hammerspoon"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "keycastr"
cask "kitty"
cask "ksdiff"
cask "libreoffice"
cask "maestral"
cask "megasync"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "miniconda"
cask "mkvtoolnix"
cask "monitorcontrol"
cask "obs"
cask "ollama"
cask "openscad"
cask "orbstack"
cask "orcaslicer"
cask "raspberry-pi-imager"
cask "rocket"
cask "signal"
cask "slack"
cask "spotify"
cask "subler"
cask "sublercli"
cask "switchresx"
cask "tower"
cask "transmit"
cask "upscayl"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "wireshark"
cask "xld"
cask "xnviewmp"
cask "zen-browser"
cask "zerotier-one"
cask "zoom"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadalli.vscode-nginx-conf"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "emallin.phpunit"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "fill-labs.dependi"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jakearl.search-editor-apply-changes"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jeff-hykin.better-shellscript-syntax"
vscode "johnpapa.vscode-cloak"
vscode "jscearcy.rust-doc-viewer"
vscode "laurenttreguier.vscode-simple-icons"
vscode "lorenzopirro.rust-flash-snippets"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mehedidracula.php-namespace-resolver"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "nyxiative.rust-and-friends"
vscode "orta.vscode-twoslash-queries"
vscode "patbenatar.advanced-new-file"
vscode "pkief.material-icon-theme"
vscode "platformio.platformio-ide"
vscode "polymeilex.rust-targets"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanolsonx.solarized"
vscode "sainnhe.gruvbox-material"
vscode "shakram02.bash-beautify"
vscode "shipitsmarter.sops-edit"
vscode "statiolake.vscode-rustfmt"
vscode "steefh.external-formatters"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "tetradresearch.vscode-h2o"
vscode "thenouillet.symfony-vscode"
vscode "timonwong.shellcheck"
vscode "tinkertrain.theme-panda"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wesbos.theme-cobalt2"
vscode "william-voyek.vscode-nginx"
vscode "woozy-masta.shell-script-ide"
vscode "xdebug.php-debug"
vscode "xshrim.txt-syntax"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhangyue.rust-mod-generator"
vscode "zobo.php-intellisense"
